test/good/dump-is-used.dot
digraph "dump-is-used" {
    node [shape=box];
    subgraph "cluster_test1" {
        label="test1";
        "test1_141" [label="let a: Int = 42"];
        "test1_142" [label="dump(a)"];
        "test1_144" [label="dump(42)"];
        "test1_146" [label="dump(\"test is called\")"];
        "test1_148" [label="dump(false)"];
        "test1_150" [label="dump(null)",style=filled,fillcolor="#66A7DB"];
        "test1_141" -> "test1_142";
        "test1_142" -> "test1_144";
        "test1_144" -> "test1_146";
        "test1_146" -> "test1_148";
        "test1_148" -> "test1_150";
    }
}
